Repository: chrisderouck/event
Catalog: Locale/nld/LC_MESSAGES/event.po
Languages: nld

source: Quick Calendar
nld: Jeugdkalender

source: Full Calendar
nld: Volledige kalender

source: Location
nld: Locatie

source: End
nld: Einde

source: Passed events from
nld: Oude evenementen uit

source: There were no events in
nld: Er waren geen evemeneten in

source: Events from
nld: Evenementen uit

source: Current Events
nld: Lopende evenementen

source: Events currently happening
nld: Lopende evenementen

source: Future events
nld: Toekomstige evenementen

source: There are no more events planned in the future.
nld: Er zijn geen evenementen gepland in de toekomst

source: Passed events
nld: Oude evenementen
